### DataFrame의 인덱스 다루기 - 
- 행 인덱스를 정수 인덱스로 초기화
- 기존 행 인덱스 ==> 컬럼으로 추가 시킴 [기본값]
- 메서드 : 변수명.reset_index()

In [1]:
import pandas as pd

In [2]:
jumsu = {'name':['마징가', '태권V', '원더우먼'],
         'kor':[89, 90, 90],
         'eng':[10, 30, 90],
         'math':[30, 60, 90]}

In [3]:
jumsu_df = pd.DataFrame(jumsu)

In [4]:
jumsu_df

   name  kor  eng  math
0   마징가   89   10    30
1   태권V   90   30    60
2  원더우먼   90   90    90

In [6]:
jumsu_df.reset_index(drop=True) # 기존의 행 인덱스를 열로 받지 않겠다.

   name  kor  eng  math
0   마징가   89   10    30
1   태권V   90   30    60
2  원더우먼   90   90    90

In [7]:
# 매개변수를 모른다면... drop으로 지우면 됨